// tools
import { combineReducers } from "redux";

// types
import {
  CHANGE_THEME,
  CHANGE_AUTH_STATUS,
  CHANGE_POP_UP_STATUS,
} from "./Types";

import img1 from "../images/animes/1.jpg";

const themeStatus = false;

const themeReducer = (state = themeStatus, action) => {
  switch (action.type) {
    case CHANGE_THEME:
      return (state = !state);

    default:
      return state;
  }
};

const authStatus = true;

const authStatusReducer = (state = authStatus, action) => {
  switch (action.type) {
    case CHANGE_AUTH_STATUS:
      return (state = true);

    default:
      return state;
  }
};

const popUpStatus = false;

const popUpReducer = (state = popUpStatus, action) => {
  switch (action.type) {
    case CHANGE_POP_UP_STATUS:
      return (state = !state);

    default:
      return state;
  }
};

const adminAnimes = [
  {
    id: 0,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
  {
    id: 1,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
  {
    id: 2,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
  {
    id: 3,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
  {
    id: 4,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
  {
    id: 5,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
  {
    id: 6,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
  {
    id: 7,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
  {
    id: 8,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
  {
    id: 9,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
  {
    id: 10,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
  {
    id: 11,
    title: "One Piece",
    ptitle: "وان پیس",
    rate: "۷.۱۸",
    tags: [
      { id: 0, title: "اکشن" },
      { id: 1, title: "علمی تخیلی" },
      { id: 2, title: "اکشن" },
      { id: 3, title: "علمی تخیلی" },
    ],
    about:
      "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
    cover: img1,
    country: "ژاپن",
    votes: "425",
  },
];

const adminAnimesReducer = (state = adminAnimes) => {
  return state;
};

export const rootReducer = combineReducers({
  themeReducer,
  authStatusReducer,
  popUpReducer,
  adminAnimesReducer,
});
