// assets
import "../styles/animes.css";
import "../styles/anime-box.css";
import img1 from "../images/animes/1.jpg";

// tools
import { Link } from "react-router-dom";

// icons
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import {
  faBookmark,
  faChartColumn,
  faMagnifyingGlass,
} from "@fortawesome/free-solid-svg-icons";

// components
import AnimesFilters from "../components/AnimesFilters";

// redux
import { useDispatch } from "react-redux";
import { openAnimesFilters } from "../redux/Actions";

const Animes = () => {
  const dispatch = useDispatch();

  const animes = [
    {
      id: 0,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
    {
      id: 1,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
    {
      id: 2,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
    {
      id: 3,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
    {
      id: 4,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
    {
      id: 5,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
    {
      id: 6,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
    {
      id: 7,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
    {
      id: 8,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
    {
      id: 9,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
    {
      id: 10,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
    {
      id: 11,
      title: "One Piece",
      ptitle: "وان پیس",
      rate: "۷.۱۸",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
        { id: 2, title: "اکشن" },
        { id: 3, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
      country: "ژاپن",
      votes: "425",
    },
  ];

  return (
    <div className="animes_container">
      <AnimesFilters />
      
      <div className="top_side">
        <form className="search_box" action="#">
          <input placeholder="جستجو در انیمه ها ..." />
          <div className="search_icon">
            <FontAwesomeIcon icon={faMagnifyingGlass} />
          </div>
        </form>

        <div
          className="filters_btn"
          onClick={() => dispatch(openAnimesFilters())}
        >
          <div>
            <FontAwesomeIcon icon={faChartColumn} />
          </div>
          فیلتر ها
        </div>
      </div>

      <div className="bottom_side">
        {animes.map((anime) => (
          <div className="anime_box animes_anime_box" key={anime.id}>
            <img src={anime.cover} alt="anime-cover" />

            <div className="anime_info">
              <div className="titles">
                <div className="e_title">{anime.title}</div>
                <div className="p_title">{anime.ptitle}</div>
              </div>

              <div className="anime_footer">
                <div className="anime_buttons">
                  <div>
                    <FontAwesomeIcon icon={faBookmark} />
                  </div>
                </div>

                <div className="score">
                  <div>
                    <span>10</span>/
                  </div>
                  {anime.rate}
                </div>
              </div>

              <Link
                to={`/animes/${anime.id}`}
                style={{ textDecoration: "none" }}
              >
                <div className="show_anime">مشاهده جزئیات</div>
              </Link>
            </div>
          </div>
        ))}
      </div>
    </div>
  );
};

export default Animes;
