// assets
import "../styles/article.css";
import img1 from "../images/animes/1.jpg";

// tools
import { useParams } from "react-router";
import { useState } from "react";

// icons
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import {
  faClock,
  faExpand,
  faCompress,
} from "@fortawesome/free-solid-svg-icons";

const Article = () => {
  const state = [
    {
      id: 0,
      title: "آشنایی با وان پیس",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
    },
    {
      id: 1,
      title: "آشنایی با وان پیس",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
    },
    {
      id: 2,
      title: "آشنایی با وان پیس",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
    },
    {
      id: 3,
      title: "آشنایی با وان پیس",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
    },
    {
      id: 4,
      title: "آشنایی با وان پیس",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
    },
    {
      id: 5,
      title: "آشنایی با وان پیس",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
    },
    {
      id: 6,
      title: "آشنایی با وان پیس",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
    },
    {
      id: 7,
      title: "آشنایی با وان پیس",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
    },
    {
      id: 8,
      title: "آشنایی با وان پیس",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
    },
    {
      id: 9,
      title: "آشنایی با وان پیس",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
    },
    {
      id: 10,
      title: "آشنایی با وان پیس",
      tags: [
        { id: 0, title: "اکشن" },
        { id: 1, title: "علمی تخیلی" },
      ],
      about:
        "داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...داستان درباره جهانی است که به دو گروه انسان‌ها و موجوداتی به نام کاتاوارا تقسیم شده‌اند. تاما که خود یک کاتاواراست بسیار عاشق انسان‌هاست و حتی اگر باید با هم‌نوعان خود بجنگد، آماده است تا آنها را از شر بدی نجات دهد. برادر تاما به نام جینکا اما انسان‌ها را دوست ندارد، نیھل که بیشتر خودش انسان است. این دو برادر به همراه شمشیرزنی بزدل به نام شینسوکه که می‌خواهد قدرتمند شود...",
      cover: img1,
    },
  ];

  const { articleId } = useParams();

  const article = state[articleId];

  const [articleStatus, setArtcileStatus] = useState(false);

  return (
    <div className={`articles_container ${articleStatus ? "show" : ""}`}>
      <div className={`right_side ${articleStatus ? "show" : ""}`}>
        <div
          className={`compress_btn ${articleStatus ? "show" : ""}`}
          onClick={() => setArtcileStatus(false)}
        >
          حالت پیشفرض
          <div>
            <FontAwesomeIcon icon={faCompress} />
          </div>
        </div>

        <img src={article.cover} alt="article-cover" />

        <div className="article_info">
          <div className="article_tags">
            {article.tags.map((tag) => (
              <div className="tag_box" key={tag.id}>
                {tag.title}
              </div>
            ))}

            <div className="article_time">
              <span>
                <FontAwesomeIcon icon={faClock} />
              </span>
              زمان مطالعه : {article.id} دقیقه
            </div>
          </div>

          <div className="title_box">{article.title}</div>

          <div className="description">{article.about}</div>
          <div className="mini_title">
            <div className="golden_dot"></div>
            آشنایی با وان پیس
          </div>

          <div className="description">{article.about}</div>
        </div>
      </div>

      <div className="left_side">
        <div className="full_screen_btn" onClick={() => setArtcileStatus(true)}>
          مطالعه با تمرکز بیشتر
          <div>
            <FontAwesomeIcon icon={faExpand} />
          </div>
        </div>

        <div className="last_articles">
          <div className="section_title_box">
            <span>جدیدترین مقالات</span>
          </div>

          <div className="row_article_boxes">
            <div className="row_article">
              <div className="gold_column"></div>

              <div className="title_box">آشنایی با وان پیس</div>

              <div className="article_time">
                <span>
                  <FontAwesomeIcon icon={faClock} />
                </span>
                زمان مطالعه : {article.id} دقیقه
              </div>
            </div>

            <div className="row_article">
              <div className="gold_column"></div>

              <div className="title_box">آشنایی با وان پیس</div>

              <div className="article_time">
                <span>
                  <FontAwesomeIcon icon={faClock} />
                </span>
                زمان مطالعه : {article.id} دقیقه
              </div>
            </div>

            <div className="row_article">
              <div className="gold_column"></div>

              <div className="title_box">آشنایی با وان پیس</div>

              <div className="article_time">
                <span>
                  <FontAwesomeIcon icon={faClock} />
                </span>
                زمان مطالعه : {article.id} دقیقه
              </div>
            </div>

            <div className="row_article">
              <div className="gold_column"></div>

              <div className="title_box">آشنایی با وان پیس</div>

              <div className="article_time">
                <span>
                  <FontAwesomeIcon icon={faClock} />
                </span>
                زمان مطالعه : {article.id} دقیقه
              </div>
            </div>

            <div className="row_article">
              <div className="gold_column"></div>

              <div className="title_box">آشنایی با وان پیس</div>

              <div className="article_time">
                <span>
                  <FontAwesomeIcon icon={faClock} />
                </span>
                زمان مطالعه : {article.id} دقیقه
              </div>
            </div>

            <div className="show_all_articles_btn">مشاهده همه مقالات</div>
          </div>
        </div>

        <div className="writer_box">
          <img className="profile_image" src={img1} alt="writer-profile" />

          <div className="writer_about">
            <div className="name">Abdolrahman Kiani</div>
            <div className="title_box">نویسنده مقاله</div>
            <div className="subscribe_btn">دنبال کردن</div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Article;
